#1 Создать переменную типа String
a = "String"
#2 Создать переменную типа Integer
b = 1
#3 Создать переменную типа Float
c = 1.2
#4 Создать переменную типа Bytes
d = b"Bytes"
#5 Создать переменную типа List
list = ["one", "two", "three"]
#6 Создать переменную типа Tuple
tuple = ("one", "two", "three")
#7 Создать переменную типа Set
set = {"one", "two", "three"}
#8 Создать переменную типа Frozen set
frozenset = frozenset({"one", "two", "three"})
#9 Создать переменную типа Dict
dict = {"name" : "Alina", "age" : 35}
#10 Вывести в консоль все выше перечисленные переменные с добавлением типа данных
print(a)
print(type(a))
print(b)
print(type(b))
print(c)
print(type(c))
print(d)
print(type(d))
print(list)
print(type(list))
print(tuple)
print(type(tuple))
print(set)
print(type(set))
print(frozenset)
print(type(frozenset))
#11 Создать 2 переменные String, создать переменную в которой суммируете эти переменные. Вывести в консоль
e = "My name is"
f = "Alina"
g = e+' '+f
print(g)
#12 Создать 2 переменные Integer, создать переменную в которой суммируете эти переменные. Вывести в консоль
h = 10
i = 12
j = h + i
print(j)
#13 Создать переменную в которой Разделите эти переменные Int. Вывести в консоль
k = 3
l = 12
m = l / k
print(m)
#14 Создать переменную в которой Умножите эти переменные Int. Вывести в консоль
o = 3
p = 12
r = o * p
print(r)
#15 Создать переменную в которой Разделите без остатка эти переменные Int. Вывести в консоль
t = 6
u = 35
v = u // t
print(v)
#16 Создать переменную в которой надо присвоить остаток от деления этих переменные Int. Вывести в консоль
w = 42
x = 4
y = w % x
print(y)
